
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <title>Правила Форума Grisvo</title>
    <link rel="stylesheet" type="text/css" href="css/forum_page.css?v=1.0">
</head>
<body>
<header class="header-container">
    <div class="header__icon-container">
        <img src="img/Grisvo_logo.png" alt="Лого Grisvo" class="header__logo">
    </div>
    <h1 class="header__ForumTopics">Правила Форума Grisvo</h1>
</header>
<main>
    <section class="rules-container">

        <h2>Уважение и вежливость:</h2>
        <p>Всегда проявляйте уважение к другим участникам форума. Никаких оскорблений, угроз или нецензурной брани не допускается.</p>
        <p>Избегайте споров и конфликтов. Если возникли разногласия, старайтесь разрешать их мирным путем.</p>

        <h2>Содержание сообщений:</h2>
        <p>Публикация контента, нарушающего законы или правила форума, запрещена.</p>
        <p>Не размещайте спам, рекламу или ненадежные ссылки.</p>
        <p>Старайтесь поддерживать актуальность дискуссий и не поднимать устаревшие темы без необходимости.</p>

        <h2>Правила конфиденциальности:</h2>
        <p>Не публикуйте личную информацию о себе или других участниках форума без их согласия.</p>
        <p>Уважайте конфиденциальность других участников, не публикуя личные сообщения или данные, полученные от них, без разрешения.</p>

        <h2>Модерация форума:</h2>
        <p>Решения модераторов форума являются окончательными. Если вы не согласны с решением, обратитесь к модераторам лично.</p>

        <h2>Аккаунты:</h2>
        <p>Защищайте свой аккаунт от несанкционированного доступа. Не доверяйте свой пароль или доступ к аккаунту другим пользователям.</p>

        <h2>Запрещенное содержание:</h2>
        <p>Форум Grisvo запрещает обсуждение, публикацию или распространение следующего контента: незаконные материалы, насилие, порнографию, дискриминацию по расовым, религиозным или половым признакам, призывы к нарушению законов и др.</p>

        <h2>Сотрудничество с модераторами:</h2>
        <p>Следуйте инструкциям и запросам модераторов форума. Они работают для поддержания порядка и безопасности на форуме.</p>

        <p class="warning">Нарушение данных правил может привести к временной или постоянной блокировке вашего аккаунта на форуме Grisvo. Учтите, что эти правила могут подвергаться изменениям, и важно регулярно ознакамливаться с актуальными версиями.</p>
    </section>
</main>
<footer>
    <p class="footer__container">© 2023
</footer>
</body>
</html>